type data =
    `${number} ${'روز' | 'هفته' | 'سال' | 'ساعت' | 'ماه'} قبل`;

export interface comment {
    img?: string | undefined;

    name: string;

    comment: string;

    date: data;

    gender: 'boy' | 'girl';
}

export const comments: comment[] = [
    {
        name: 'مریم رضایی',
        comment:
            'آقای رفیعی با راهنمایی‌های دقیق‌شون باعث شدند من بتونم در رشته پزشکی قبول بشم. بسیار متعهد و دلسوز هستند.',
        img: '/images/users/girls/01.webp',
        date: '5 روز قبل',
        gender: 'girl',
    },
    {
        name: 'کیان شریفی',
        comment:
            'آقای رفیعی با صبوری و دانش بالا همیشه پاسخگوی سوالات من بودند. واقعاً ازشون ممنونم.',
        img: '/images/users/boys/02.webp',
        date: '2 هفته قبل',
        gender: 'boy',
    },
    {
        name: 'نازنین محمودی',
        comment:
            'آقای رفیعی با ایجاد انگیزه در من، باعث شدند که با اعتماد به نفس بیشتری برای کنکور تلاش کنم.',
        date: '2 هفته قبل',
        gender: 'girl',
    },
    {
        name: 'محمدرضا کاظمی',
        comment:
            'بدون مشاوره‌های آقای رفیعی، مسیر من در کنکور کاملاً متفاوت بود. ایشون راهنمایی‌های خیلی ارزشمندی داشتند.',
        img: '/images/users/boys/03.webp',
        date: '12 روز قبل',
        gender: 'boy',
    },
    {
        name: 'پوریا اسکندری',
        comment:
            'برنامه‌ریزی منظم آقای رفیعی من رو به موفقیت در کنکور رسوند. بسیار سپاسگزارم.',
        date: '9 روز قبل',
        gender: 'boy',
    },
    {
        name: 'الهام کرمی',
        comment:
            'مشاوره‌های آقای رفیعی خیلی به من کمک کرد تا برنامه‌ریزی بهتری برای کنکور داشته باشم. همیشه در دسترس و پاسخگو هستند.',
        img: '/images/users/girls/02.webp',
        date: '10 روز قبل',
        gender: 'girl',
    },
    {
        name: 'سمانه کریمی',
        comment:
            'مشاوره‌های آقای رفیعی بسیار تأثیرگذار بود. با کمک ایشون تونستم برنامه‌ریزی منظمی برای دروسم داشته باشم.',
        img: '/images/users/girls/05.webp',
        date: '3 هفته قبل',
        gender: 'girl',
    },
    {
        name: 'امیرعلی پارسا',
        comment:
            'راهنمایی‌های آقای رفیعی من رو در انتخاب رشته کمک کرد و باعث شد بهترین تصمیم رو بگیرم.',
        date: '5 روز قبل',
        gender: 'boy',
    },
    {
        name: 'فاطمه اسدی',
        comment:
            'آقای رفیعی با انگیزه و پشتکارشون همیشه به ما انرژی می‌دادند. واقعاً یکی از بهترین مشاورهای تحصیلی هستند.',
        img: '/images/users/girls/03.webp',
        date: '1 هفته قبل',
        gender: 'girl',
    },
    {
        name: 'پرهام صفری',
        comment:
            'آقای رفیعی با دقت و دانش بالاشون در انتخاب رشته من رو راهنمایی کردند. ازشون واقعاً ممنونم.',
        date: '4 روز قبل',
        gender: 'boy',
    },
    {
        name: 'علی رضایی',
        comment:
            'آقای رفیعی به من کمک کردند تا بتونم توی رشته حقوق دانشگاه دلخواهم قبول بشم. مشاوره‌هاشون دقیق و کارآمد بود.',
        img: '/images/users/boys/04.webp',
        date: '4 هفته قبل',
        gender: 'boy',
    },
    {
        name: 'الهه حسینی',
        comment:
            'آقای رفیعی یکی از برترین مشاورهای تحصیلی هستند که همیشه حواس‌شون به دانش‌آموزانشون هست.',
        date: '3 هفته قبل',
        gender: 'girl',
    },
    {
        name: 'هانیه ملکی',
        comment:
            'با مشاوره‌های حرفه‌ای آقای رفیعی تونستم به بهترین نحو برای کنکور آماده بشم.',
        date: '1 ماه قبل',
        gender: 'girl',
    },
    {
        name: 'زهرا نعمتی',
        comment:
            'برنامه‌ریزی که آقای رفیعی برای من تنظیم کردند فوق‌العاده بود. تونستم با آرامش بیشتری برای کنکور آماده بشم.',
        img: '/images/users/girls/04.webp',
        date: '6 روز قبل',
        gender: 'girl',
    },
    {
        name: 'رضا توکلی',
        comment:
            'راهنمایی‌های آقای رفیعی کمک بزرگی در موفقیت من در کنکور بود. از ایشون متشکرم.',
        date: '2 هفته قبل',
        gender: 'boy',
    },
    {
        name: 'مهران زمانی',
        comment:
            'آقای رفیعی با صبوری و راهنمایی‌های ارزشمندشون به من کمک کردند تا بهترین نتیجه رو تو کنکور بگیرم.',
        date: '2 روز قبل',
        gender: 'boy',
    },
    {
        name: 'علیرضا موسوی',
        comment:
            'برنامه‌ریزی دقیق و مشاوره‌های حرفه‌ای آقای رفیعی باعث شد تا بتونم بهترین نتیجه رو توی کنکور کسب کنم.',
        date: '3 روز قبل',
        gender: 'boy',
    },
    {
        name: 'سارا تهرانی',
        comment:
            'مشاوره‌های دقیق و انگیزشی آقای رفیعی باعث شد تا با برنامه‌ریزی بهتری به سمت اهدافم حرکت کنم.',
        date: '3 هفته قبل',
        gender: 'girl',
    },
    {
        name: 'شادی کریمی',
        comment:
            'راهنمایی‌های دقیق آقای رفیعی به من کمک کرد تا برنامه‌ریزی بهتری برای کنکور داشته باشم.',
        date: '6 روز قبل',
        gender: 'girl',
    },
    {
        name: 'نوید کاظمی',
        comment:
            'بدون مشاوره‌های آقای رفیعی، قبولی در کنکور برای من به این راحتی ممکن نبود.',
        date: '12 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ندا یوسفی',
        comment:
            'مشاوره‌های دقیق و برنامه‌ریزی عالی آقای رفیعی تأثیر خیلی خوبی در نتیجه کنکور من داشت.',
        date: '8 روز قبل',
        gender: 'girl',
    },
];
