type data =
    `${number} ${'روز' | 'هفته' | 'سال' | 'ساعت'} قبل`;

interface comment {
    img?: string | undefined;

    name: string;

    comment: string;

    date: data;

    gender: 'boy' | 'girl';
}

export const comments: comment[] = [
    {
        name: 'سارینا احمدی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/girls/01.webp',
        date: '8 روز قبل',
        gender: 'girl',
    },
    {
        name: 'سارینا احمدی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/girls/02.webp',
        date: '8 روز قبل',
        gender: 'girl',
    },
    {
        name: 'سارینا احمدی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/girls/03.webp',
        date: '8 روز قبل',
        gender: 'girl',
    },
    {
        name: 'سارینا احمدی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/girls/04.webp',
        date: '8 روز قبل',
        gender: 'girl',
    },
    {
        name: 'سارینا احمدی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/girls/05.webp',
        date: '8 روز قبل',
        gender: 'girl',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/01.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/02.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/03.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
    {
        name: 'ارش رحمانی',
        comment:
            'آقای رفیعی به مدت چهار سال مشاور کنکوری بنده بودند، ایشون بسیار وظیفه شناس و خوش برخورد هستند',
        img: '/images/users/boys/04.webp',
        date: '8 روز قبل',
        gender: 'boy',
    },
];
